<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted'             => 'יש להתקבל בתכונה: ',
    'active_url'           => 'התכונה: אינה כתובת URL חוקית. ',
    'after'                => 'התכונה: חייבת להיות תאריך שאחרי: תאריך. ',
    'after_or_equal'       => 'התכונה: חייבת להיות תאריך אחרי או תאריך: תאריך. ',
    'alpha'                => 'התכונה: עשויה להכיל אותיות בלבד. ',
    'alpha_dash'           => 'התכונה: עשויה להכיל רק אותיות, מספרים ומקפים. ',
    'alpha_num'            => 'התכונה: עשויה להכיל אותיות ומספרים בלבד. ',
    'array'                => 'התכונה: חייבת להיות מערך.',
    'before'               => 'התכונה: חייבת להיות תאריך לפני: תאריך. ',
    'before_or_equal'      => 'התכונה: חייבת להיות תאריך לפני או שווה ל: תאריך. ',
    'between'              => [
        'numeric' => 'התכונה: חייבת להיות בין: דקות ל: מקסימום.',
        'file'    => 'התכונה: חייבת להיות בין: דקות ל-: מקסימום קילובייט. ',
        'string'  => 'התכונה: חייבת להיות בין: דקות ל: מקסימום תווים. ',
        'array'   => 'התכונה: חייבת לכלול בין: מינימום לפריטים מקסימליים. ',
    ],
    'boolean'              => 'שדה התכונות חייב להיות נכון או לא נכון. ',
    'confirmed'            => 'אישור התכונה: אינו תואם. ',
    'date'                 => 'התכונה: אינה תאריך תקף. ',
    'date_format'          => 'התכונה: אינה תואמת את הפורמט:.',
    'different'            => 'המאפיין: and צריך להיות שונה.',
    'digits'               => 'התכונה: חייבת להיות: ספרות ספרות. ',
    'digits_between'       => 'התכונה: חייבת להיות בין: דקות ל: ספרות מקסימאלית.',
    'dimensions'           => 'לתכונה: יש מאפייני תמונה לא חוקיים.',
    'distinct'             => 'לשדה המאפיין יש ערך כפול. ',
    'email'                => 'התכונה: חייבת להיות כתובת דוא"ל חוקית.',
    'exists'               => 'התכונה שנבחרה: אינה חוקית.',
    'file'                 => 'התכונה: חייבת להיות קובץ. ',
    'filled'               => 'שדה המאפיין חייב להיות בעל ערך.',
    'image'                => 'התכונה: חייבת להיות תמונה. ',
    'in'                   => 'התכונה שנבחרה: אינה חוקית. ',
    'in_array'             => 'שדה התכונות אינו קיים ב: אחר. ',
    'integer'              => 'התכונה: חייבת להיות מספר שלם. ',
    'ip'                   => 'התכונה: חייבת להיות כתובת IP חוקית. ',
    'ipv4'                 => 'התכונה: חייבת להיות כתובת IP חוקית.',
    'ipv6'                 => 'התכונה: חייבת להיות כתובת IPv6 חוקית.',
    'json'                 => 'התכונה: חייבת להיות מחרוזת JSON תקפה. ',
    'max'                  => [
        'numeric' => 'המאפיין: לא יכול להיות גדול מ: מקסימום. ',
        'file'    => 'המאפיין: לא יכול להיות גדול מ: מקסימום קילובייט. ',
        'string'  => 'התכונה: לא עשויה להיות גדולה מ: מקסימום תווים.',
        'array'   => 'המאפיין: לא יכול לכלול יותר מ- פריטים מקסימום.',
    ],
    'mimes'                => 'התכונה: חייבת להיות קובץ מסוג:: ערכים. ',
    'mimetypes'            => 'התכונה: חייבת להיות קובץ מסוג:: ערכים.',
    'min'                  => [
        'numeric' => 'התכונה: חייבת להיות לפחות: דקות. ',
        'file'    => 'התכונה: חייבת להיות לפחות: קילובייט דקה. ',
        'string'  => 'התכונה: חייבת להיות לפחות: מיני תווים.',
        'array'   => 'התכונה: חייבת לכלול לפחות: פריטי דקות.',
    ],
    'not_in'               => 'התכונה שנבחרה: אינה חוקית.',
    'numeric'              => 'התכונה: חייבת להיות מספר.',
    'present'              => 'שדה התכונה חייב להיות קיים.',
    'regex'                => 'פורמט המאפיין אינו חוקי.',
    'required'             => 'שדה המאפיין נדרש. ',
    'required_if'          => 'שדה המאפיין נדרש כאשר: אחר הוא: ערך.',
    'required_unless'      => 'שדה המאפיין נדרש אלא אם כן: אחר נמצא ב: ערכים.',
    'required_with'        => 'שדה המאפיין נדרש כאשר: ערכים קיימים.',
    'required_with_all'    => 'שדה המאפיין נדרש כאשר: ערכים קיימים.',
    'required_without'     => 'שדה המאפיין נדרש כאשר: ערכים אינם קיימים.',
    'required_without_all' => 'שדה המאפיין נדרש כאשר לא קיימים אף אחד מהערכים.',
    'same'                 => 'התכונה: ו-: אחר חייבים להתאים.',
    'size'                 => [
        'numeric' => 'התכונה: חייבת להיות: גודל.',
        'file'    => 'התכונה: חייבת להיות: קילובייט בגודל.',
        'string'  => 'התכונה: חייבת להיות: תווים בגודל.',
        'array'   => 'התכונה: חייבת להכיל: פריטי גודל.',
    ],
    'string'               => 'התכונה: חייבת להיות מחרוזת.',
    'timezone'             => 'התכונה: חייבת להיות אזור תקף.',
    'unique'               => 'התכונה: כבר נלקחה.',
    'uploaded'             => 'התכונה: העלאה נכשלה.',
    'url'                  => 'פורמט המאפיין אינו חוקי.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'הודעה מותאמת אישית ',

        ],
        'items.*.description' =>[
            'required' => 'יש צורך בתיאור '
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [],

];
